GadgetOnOff Project/src/DataProcessors/ЗаполнениеГрафика/ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

GadgetOnOff Project/src/InformationRegisters/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботы</name>
  <resources>
    <name>ЗначениеЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GadgetOnOff Project/src/DataProcessors/ЗаполнениеГрафика/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, График) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
			Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Запись.График = График;
			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
				Запись.ЗначениеЧасы = 0;
				Запись.ЗначениеДни = 0;
			Иначе	          
				Запись.ЗначениеЧасы = График.КоличествоЧасов;
				Запись.ЗначениеДни = 1;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.Дата = Дат;
				НоваяЗапись.График = График;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.ЗначениеЧасы = 0;
					НоваяЗапись.ЗначениеДни = 0;
				Иначе	          
					НоваяЗапись.ЗначениеЧасы = График.КоличествоЧасов;
					НоваяЗапись.ЗначениеДни = 1;
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
			КонецЦикла; 
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Запись.График = График;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.ЗначениеЧасы = 0;
					Запись.ЗначениеДни = 0;
				Иначе	          
					Запись.ЗначениеЧасы = График.КоличествоЧасов;
					Запись.ЗначениеДни = 1;      
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Запись.График = График;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.ЗначениеЧасы = 0;
			Запись.ЗначениеДни = 0;
		Иначе	          
			Запись.ЗначениеЧасы = График.КоличествоЧасов;
			Запись.ЗначениеДни = 1;
		КонецЕсли;
		
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
